#### Pandas Review

In [6]:
import pandas as pd

In [30]:
df = pd.DataFrame({
    'id':[1,2,3],
    'name':['Sam','Jordan','Dylan'],
    'grade':['A','A','B']
})
db = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns= ['A','B','C'],index=['X','Y','Z'])

In [ ]:
df.head()

   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9

In [16]:
df.tail()

   id    name grade
0   1     Sam     A
1   2  Jordan     A
2   3   Dylan     B

In [19]:
df

   id    name grade
0   1     Sam     A
1   2  Jordan     A
2   3   Dylan     B

In [ ]:
df.columns #gives column names
df.index # gives index start, stop, and step value
df.index.tolist() #just gives list of index values

[0, 1, 2]

In [ ]:
df.info() #gives data type, column name, index, count, and if null values are allowed

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   name    3 non-null      object
 2   grade   3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [ ]:
df.describe() #gives summary stats on numerical columns

        id
count  3.0
mean   2.0
std    1.0
min    1.0
25%    1.5
50%    2.0
75%    2.5
max    3.0

In [ ]:
df.nunique() #unique values each column

id       3
name     3
grade    2
dtype: int64

In [ ]:
df.shape #gives number of column and rows within the dataframe

(3, 3)

In [ ]:
df.size #total # of data values

9

In [ ]:
#pd.readcsv("") allows you to read the CSV 
#Problem with CSV files is that they are huge another way is feather format or parquet file
# or you can

In [ ]:
#pd.read_parquet() how to read parquet file

In [ ]:
#pd.read_excel(, sheet_name = "results or a sheet name") how to read excel file